In [1]:
import pandas as pd
import numpy as np
import math
import sys
import re
import collections

In [2]:
print(f"Python version: {sys.version}")
print(f"Pandas version: {pd.__version__}")
print(f"Numpy version : {np.__version__}")

Python version: 3.8.3 (default, May 19 2020, 06:50:17) [MSC v.1916 64 bit (AMD64)]
Pandas version: 1.1.1
Numpy version : 1.19.1

# Pandas Cheatsheet
### https://www.w3resource.com/python-exercises/pandas/index.php

## Series

Write a Python program to create and display a one-dimensional array-like object containing an array of data using Pandas module

In [3]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

Write a Python program to convert a Panda module Series to Python list and it's type.

In [4]:
type(pd.Series([1, 2, 3]))

pandas.core.series.Series

In [5]:
type(pd.Series([1, 2, 3]).tolist())

list

Write a Python program to get the largest integer smaller or equal to the division of the inputs

In [6]:
s1 = pd.Series([2, 4, 6, 8, 10])
s2 = pd.Series([1, 3, 5, 7, 9])
(s1/s2).apply(lambda x: math.ceil(x))

0    2
1    2
2    2
3    2
4    2
dtype: int64

Write a Python program to convert a dictionary to a Pandas series

In [7]:
pd.Series({'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800})

a    100
b    200
c    300
d    400
e    800
dtype: int64

Write a Python program to convert a NumPy array to a Pandas series.

In [8]:
pd.Series(np.array([1, 2, 3]))

0    1
1    2
2    3
dtype: int32

Write a Python program to change the data type of given a column or a Series

In [9]:
pd.to_numeric(pd.Series({0: 100, 1: 200, 2: "python", 3: 300.12, 4: 400}), errors='coerce')

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [10]:
pd.Series({0: 100, 1: 200, 2: "python", 3: 300.12, 4: 400}).astype(np.float64, errors="ignore")

0       100
1       200
2    python
3    300.12
4       400
dtype: object

Write a Python Pandas program to convert the first column of a DataFrame as a Series.

In [11]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)

In [12]:
df.loc[:,'col1']

0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64

Write a Pandas program to convert Series of lists to one Series

In [13]:
s = pd.Series([
    ['Red', 'Green', 'White'],
    ['Red', 'Black'],
    ['Yellow']])

In [14]:
df = s.apply(pd.Series)

In [15]:
df

        0      1      2
0     Red  Green  White
1     Red  Black    NaN
2  Yellow    NaN    NaN

In [16]:
df.stack()

0  0       Red
   1     Green
   2     White
1  0       Red
   1     Black
2  0    Yellow
dtype: object

In [17]:
df.stack().reset_index(drop=True)

0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

Write a Pandas program to sort a given Series

In [18]:
pd.Series(['100', '200', 'python', '300.12', '400']).sort_values()

0       100
1       200
3    300.12
4       400
2    python
dtype: object

Write a Pandas program to add some data to an existing Series

In [19]:
pd.Series([1, 2]).append(pd.Series([3, 4]))

0    1
1    2
0    3
1    4
dtype: int64

In [20]:
pd.Series([1, 2]).append(pd.Series([3, 4])).reset_index(drop=True)

0    1
1    2
2    3
3    4
dtype: int64

Write a Pandas program to create a subset of a given series based on value and condition

In [21]:
pd.Series([1, 2, 3, 4]).loc[lambda x: x < 3]

0    1
1    2
dtype: int64

Write a Pandas program to change the order of index of a given series

In [22]:
s = pd.Series(data = [1, 2, 3, 4, 5], index = ['A', 'B', 'C', 'D', 'E'])

In [23]:
s.reindex(index=['B', 'A'])

B    2
A    1
dtype: int64

In [24]:
s.reindex(index=['B', 'A', 'C', 'C', 'D', 'E'])

B    2
A    1
C    3
C    3
D    4
E    5
dtype: int64

Write a Pandas program to create the mean and standard deviation of the data of a given Series

In [25]:
s.mean()

3.0

In [26]:
s.std()

1.5811388300841898

Write a Pandas program to get the items of a given series not present in another given series

In [27]:
s1 = pd.Series([1, 2, 3, 4])
s2 = pd.Series([5, 2, 8, 9])

In [28]:
s1.loc[~s1.isin(s2)]

0    1
2    3
3    4
dtype: int64

Write a Pandas program to get the items which are not common of two given series

In [29]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([2, 4, 6, 8, 10])
u12 = pd.Series(np.union1d(s1, s2))
i12 = pd.Series(np.intersect1d(s1, s2))
u12.loc[~u12.isin(i12)]

0     1
2     3
4     5
5     6
6     8
7    10
dtype: int64

Write a Pandas program to compute the minimum, 25th percentile, median, 75th, and maximum of a given series

In [30]:
np.percentile(s, q=[0, 25, 50, 75, 100])

array([1., 2., 3., 4., 5.])

Write a Pandas program to calculate the frequency counts of each unique value of a given series

In [31]:
s = pd.Series(np.take(list('0123456789'), np.random.randint(10, size=40)))

In [32]:
s = s.value_counts()

In [33]:
s.reset_index().rename(columns={"index": "value", 0: "count"})

  value  count
0     9      6
1     4      6
2     1      5
3     2      5
4     7      5
5     8      4
6     3      3
7     0      2
8     6      2
9     5      2

Write a Pandas program to display most frequent value in a given series and replace everything else as 'Other' in the series

In [34]:
s = pd.Series([1, 2, 3, 3, 3, 4, 5, 5])

In [35]:
# value_counts() gives sorted
s.loc[~s.isin(s.value_counts().index[:1])] = 'other'

In [36]:
s

0    other
1    other
2        3
3        3
4        3
5    other
6    other
7    other
dtype: object

Write a Pandas program to find the positions of numbers that are multiples of 5 of a given series

In [37]:
s = pd.Series([1, 2, 3, 3, 3, 4, 5, 5, 10, 15])

In [38]:
s.loc[s%5==0].index.tolist()

[6, 7, 8, 9]

Write a Pandas program to extract items at given positions of a given series

In [39]:
s = pd.Series(list('2390238923902390239023'))
pos = [0, 2, 6, 11, 21]

In [40]:
s.loc[s.index.isin(pos)]

0     2
2     9
6     8
11    0
21    3
dtype: object

Write a Pandas program convert the first and last character of each word to upper case in each word of a given series

In [41]:
s = pd.Series(['php', 'python', 'java', 'c#'])

In [42]:
s.apply(lambda word: word[0].upper() + word[1:-1] + word[-1].upper() if word else word)

0       PhP
1    PythoN
2      JavA
3        C#
dtype: object

Write a Pandas program to calculate the number of characters in each word in a given series

In [43]:
s = pd.Series(['php', 'python', 'java', 'c#'])

In [44]:
s.apply(lambda word: len(word))

0    3
1    6
2    4
3    2
dtype: int64

Write a Pandas program to compute difference of differences between consecutive numbers of a given series

In [45]:
s = pd.Series([1, 3, 5, 8, 10, 11, 15])

In [46]:
s.diff()

0    NaN
1    2.0
2    2.0
3    3.0
4    2.0
5    1.0
6    4.0
dtype: float64

In [47]:
s.diff().diff()

0    NaN
1    NaN
2    0.0
3    1.0
4   -1.0
5   -1.0
6    3.0
dtype: float64

Write a Pandas program to convert a series of date strings to a timeseries

In [48]:
pd.to_datetime(pd.Series(['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20']))

0   2015-01-01 00:00:00
1   2016-10-02 00:00:00
2   2018-03-07 00:00:00
3   2014-05-06 00:00:00
4   2016-04-12 00:00:00
5   2019-04-06 11:20:00
dtype: datetime64[ns]

Write a Pandas program to get the day of month, day of year, week number and day of week from a given series of date strings

In [49]:
s = pd.to_datetime(pd.Series(['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20']))

In [50]:
s.apply(lambda date: date.day) # date.month and date.year for month and year respectively

0     1
1     2
2     7
3     6
4    12
5     6
dtype: int64

Write a Pandas program to convert year-month string to dates adding a specified day of the month

In [51]:
s = pd.Series(['Jan 2015', 'Feb 2016', 'Mar 2017', 'Apr 2018', 'May 2019'])

In [52]:
pd.to_datetime(s.apply(lambda x: "1 " + x))

0   2015-01-01
1   2016-02-01
2   2017-03-01
3   2018-04-01
4   2019-05-01
dtype: datetime64[ns]

Write a Pandas program to filter words from a given series that contain atleast two vowels

In [53]:
s = pd.Series(['Red', 'Green', 'Orange', 'Pink', 'Yellow', 'White'])

In [54]:
s.loc[s.apply(lambda word: sum(1 for c in word if c.lower() in 'aeiou')) >= 2]

1     Green
2    Orange
4    Yellow
5     White
dtype: object

Write a Pandas program to compute the Euclidean distance between two given series

In [55]:
x = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
y = pd.Series([11, 8, 7, 5, 6, 5, 3, 4, 7, 1])

In [56]:
((x - y) ** 2).sum() ** 0.5

16.492422502470642

Write a Pandas program to find the positions of the values neighboured by smaller values on both sides in a given series

In [57]:
s = pd.Series([1, 8, 7, 5, 6, 5, 3, 4, 7, 1])

In [58]:
np.sign(np.diff(s))

array([ 1, -1, -1,  1, -1, -1,  1,  1, -1], dtype=int64)

In [59]:
np.diff(np.sign(np.diff(s)))

array([-2,  0,  2, -2,  0,  2,  0, -2], dtype=int64)

In [60]:
s.loc[np.concatenate((np.array([0, 0]), np.diff(np.sign(np.diff(s))))) == -2].index - 1

Int64Index([1, 4, 8], dtype='int64')

Write a Pandas program to replace missing white spaces in a given string with the least frequent character

In [61]:
s = pd.Series(['abc def abcdef icd'])

In [62]:
def func(string):
    counts = collections.Counter(string)
    min_count = min(counts.values())
    lfc = [k for k, v in counts.items() if v == min_count][0]
    return "".join(c if c != ' ' else lfc for c in string)

In [63]:
s.apply(func)

0    abcidefiabcdefiicd
dtype: object

Write a Pandas program to create a TimeSeries to display all the Sundays of given year.

In [64]:
pd.Series(pd.date_range('2020-01-01', periods=52, freq='W-SUN'))

0    2020-01-05
1    2020-01-12
2    2020-01-19
3    2020-01-26
4    2020-02-02
5    2020-02-09
6    2020-02-16
7    2020-02-23
8    2020-03-01
9    2020-03-08
10   2020-03-15
11   2020-03-22
12   2020-03-29
13   2020-04-05
14   2020-04-12
15   2020-04-19
16   2020-04-26
17   2020-05-03
18   2020-05-10
19   2020-05-17
20   2020-05-24
21   2020-05-31
22   2020-06-07
23   2020-06-14
24   2020-06-21
25   2020-06-28
26   2020-07-05
27   2020-07-12
28   2020-07-19
29   2020-07-26
30   2020-08-02
31   2020-08-09
32   2020-08-16
33   2020-08-23
34   2020-08-30
35   2020-09-06
36   2020-09-13
37   2020-09-20
38   2020-09-27
39   2020-10-04
40   2020-10-11
41   2020-10-18
42   2020-10-25
43   2020-11-01
44   2020-11-08
45   2020-11-15
46   2020-11-22
47   2020-11-29
48   2020-12-06
49   2020-12-13
50   2020-12-20
51   2020-12-27
dtype: datetime64[ns]

 Write a Pandas program to stack two given series vertically and horizontally

In [65]:
s1 = pd.Series(range(10))
s2 = pd.Series(list('pqrstuvwxy'))

In [66]:
s1.append(s2) # pd.concat([s1, s2], axis=0)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
0    p
1    q
2    r
3    s
4    t
5    u
6    v
7    w
8    x
9    y
dtype: object

In [67]:
pd.concat([s1, s2], axis=1)

   0  1
0  0  p
1  1  q
2  2  r
3  3  s
4  4  t
5  5  u
6  6  v
7  7  w
8  8  x
9  9  y

Write a Pandas program to find the index of the first occurrence of the smallest and largest value of a given series

In [68]:
s = pd.Series([1, 3, 7, 12, 88, 23, 3, 1, 9, 0])

In [69]:
s.idxmin()

9

In [70]:
s.idxmax()

4

Check inequality over the index axis of a given dataframe and a given series

In [71]:
df = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,75,None,80,86], 'Y':[84,94,89,86,86],'Z':[86,97,96,72,83]});
s = pd.Series([68, 75, 86, 80, None])

In [72]:
df.apply(lambda row: ~(row==s))

       W      X     Y     Z
0  False   True  True  True
1  False  False  True  True
2  False   True  True  True
3  False  False  True  True
4   True   True  True  True

## DataFrame

Display a summary of the basic information about a specified DataFrame and its data

In [73]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
              'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
              'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
              'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)
print("Summary of the basic information about this DataFrame and its data:")
df.info()
df.describe()

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

           score   attempts
count   8.000000  10.000000
mean   13.562500   1.900000
std     4.693746   0.875595
min     8.000000   1.000000
25%     9.000000   1.000000
50%    13.500000   2.000000
75%    17.125000   2.750000
max    20.000000   3.000000

Write a Pandas program to get the first 3 rows of a given DataFrame

In [74]:
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Write a Pandas program to select the 'name' and 'score' columns from the DataFrame

In [75]:
df.loc[:, ['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

Write a Pandas program to select the specified columns and rows from a given data frame

In [76]:
df.loc[['b', 'd', 'f', 'g'], ['name', 'score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2

In [77]:
df.loc[df.loc[:, 'attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

Write a Pandas program to count the number of rows and columns of a DataFrame

In [78]:
len(df)

10

In [79]:
len(df.iloc[0])

4

In [80]:
df.shape

(10, 4)

In [81]:
df.axes[0]

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [82]:
df.axes[1]

Index(['name', 'score', 'attempts', 'qualify'], dtype='object')

Write a Pandas program to select the rows where the score is missing, i.e. is NaN

In [83]:
df.loc[df.loc[:, 'score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

Write a Pandas program to select the rows the score is between 15 and 20

In [84]:
df.loc[(df.loc[:, 'score'] <= 20) & (df.loc[:, 'score'] >= 15)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [85]:
df.loc[df.loc[:, 'score'].between(15, 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15

In [86]:
df.loc[(df.loc[:, 'attempts'] < 2) & (df.loc[:, 'score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

Write a Pandas program to change the score in row 'd' to 11.5

In [87]:
df.loc[['d'], ['score']] = 11.5 # df.loc['d', 'score']
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [88]:
df.loc[['d'], ['score']] = np.nan

Write a Pandas program to calculate the sum of the examination attempts by the students

In [89]:
df.loc[:, 'attempts'].sum()

19

Write a Pandas program to calculate the mean score for each different student in DataFrame

In [90]:
df.loc[:, 'score'].mean()

13.5625

Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame

In [91]:
df.loc['k'] = ['Suresh', 1, 15.5, 'yes']

In [92]:
df

        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
b       Dima    9.0       3.0      no
c  Katherine   16.5       2.0     yes
d      James    NaN       3.0      no
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
h      Laura    NaN       1.0      no
i      Kevin    8.0       2.0      no
j      Jonas   19.0       1.0     yes
k     Suresh    1.0      15.5     yes

In [93]:
df.drop('k', inplace=True)

In [94]:
df

        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
b       Dima    9.0       3.0      no
c  Katherine   16.5       2.0     yes
d      James    NaN       3.0      no
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
h      Laura    NaN       1.0      no
i      Kevin    8.0       2.0      no
j      Jonas   19.0       1.0     yes

Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order

In [95]:
df.sort_values(by=['name', 'score'], axis=0, ascending=[False, True])

        name  score  attempts qualify
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
h      Laura    NaN       1.0      no
i      Kevin    8.0       2.0      no
c  Katherine   16.5       2.0     yes
j      Jonas   19.0       1.0     yes
d      James    NaN       3.0      no
e      Emily    9.0       2.0      no
b       Dima    9.0       3.0      no
a  Anastasia   12.5       1.0     yes

Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [96]:
def convert_yes_no(string):
    if string == 'yes':
        return True
    elif string == 'no':
        return False

In [97]:
df.loc[:, 'qualify'] = df.loc[:, 'qualify'].apply(convert_yes_no)

In [98]:
df

        name  score  attempts  qualify
a  Anastasia   12.5       1.0     True
b       Dima    9.0       3.0    False
c  Katherine   16.5       2.0     True
d      James    NaN       3.0    False
e      Emily    9.0       2.0    False
f    Michael   20.0       3.0     True
g    Matthew   14.5       1.0     True
h      Laura    NaN       1.0    False
i      Kevin    8.0       2.0    False
j      Jonas   19.0       1.0     True

Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame

In [99]:
df.loc[df.loc[:, 'name'] == 'James', 'name'] = 'Suresh'

In [100]:
df

        name  score  attempts  qualify
a  Anastasia   12.5       1.0     True
b       Dima    9.0       3.0    False
c  Katherine   16.5       2.0     True
d     Suresh    NaN       3.0    False
e      Emily    9.0       2.0    False
f    Michael   20.0       3.0     True
g    Matthew   14.5       1.0     True
h      Laura    NaN       1.0    False
i      Kevin    8.0       2.0    False
j      Jonas   19.0       1.0     True

Write a Pandas program to delete the 'attempts' column from the DataFrame

In [101]:
df.drop(axis=1, labels='attempts')

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d     Suresh    NaN    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

Write a Pandas program to insert a new column in existing DataFrame

In [102]:
df.loc[:, 'color'] = ['red'] * len(df)

In [103]:
df

        name  score  attempts  qualify color
a  Anastasia   12.5       1.0     True   red
b       Dima    9.0       3.0    False   red
c  Katherine   16.5       2.0     True   red
d     Suresh    NaN       3.0    False   red
e      Emily    9.0       2.0    False   red
f    Michael   20.0       3.0     True   red
g    Matthew   14.5       1.0     True   red
h      Laura    NaN       1.0    False   red
i      Kevin    8.0       2.0    False   red
j      Jonas   19.0       1.0     True   red

Write a Pandas program to iterate over rows in a DataFrame

In [104]:
for i, row in df.iterrows():
    print(row)

name        Anastasia
score            12.5
attempts            1
qualify          True
color             red
Name: a, dtype: object
name         Dima
score           9
attempts        3
qualify     False
color         red
Name: b, dtype: object
name        Katherine
score            16.5
attempts            2
qualify          True
color             red
Name: c, dtype: object
name        Suresh
score          NaN
attempts         3
qualify      False
color          red
Name: d, dtype: object
name        Emily
score           9
attempts        2
qualify     False
color         red
Name: e, dtype: object
name        Michael
score            20
attempts          3
qualify        True
color           red
Name: f, dtype: object
name        Matthew
score          14.5
attempts          1
qualify        True
color           red
Name: g, dtype: object
name        Laura
score         NaN
attempts        1
qualify     False
color         red
Name: h, dtype: object
name        Kevin
score           8
attempts        2
qualify     False
color         red
Name: i, dtype: object
name        Jonas
score          19
attempts        1
qualify      True
color         red
Name: j, dtype: object

Write a Pandas program to get list from DataFrame column headers

In [105]:
df.axes[1]

Index(['name', 'score', 'attempts', 'qualify', 'color'], dtype='object')

In [106]:
df.columns

Index(['name', 'score', 'attempts', 'qualify', 'color'], dtype='object')

Write a Pandas program to rename columns of a given DataFrame

In [107]:
df.columns = ['a', 'b', 'c', 'd', 'e']

In [108]:
df

           a     b    c      d    e
a  Anastasia  12.5  1.0   True  red
b       Dima   9.0  3.0  False  red
c  Katherine  16.5  2.0   True  red
d     Suresh   NaN  3.0  False  red
e      Emily   9.0  2.0  False  red
f    Michael  20.0  3.0   True  red
g    Matthew  14.5  1.0   True  red
h      Laura   NaN  1.0  False  red
i      Kevin   8.0  2.0  False  red
j      Jonas  19.0  1.0   True  red

Write a Pandas program to select rows from a given DataFrame based on values in some columns

In [109]:
df.loc[df.loc[:, 'c'] == 2.0]

           a     b    c      d    e
c  Katherine  16.5  2.0   True  red
e      Emily   9.0  2.0  False  red
i      Kevin   8.0  2.0  False  red

Write a Pandas program to change the order of a DataFrame columns

In [110]:
df = pd.DataFrame({'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]})

In [111]:
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [112]:
df = df.loc[:, ['col1', 'col3', 'col2']]

In [113]:
df

   col1  col3  col2
0     1     7     4
1     4     8     5
2     3     9     6
3     4     0     7
4     5     1     8

Write a Pandas program to count city wise number of people from a given of data set (city, name of the person)

In [114]:
df = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})

In [115]:
df

        name         city
0  Anastasia   California
1       Dima  Los Angeles
2  Katherine   California
3      James   California
4      Emily   California
5    Michael  Los Angeles
6    Matthew  Los Angeles
7      Laura      Georgia
8      Kevin      Georgia
9      Jonas  Los Angeles

In [116]:
df.groupby(["city"]).size().reset_index(name="Number of people")

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [117]:
df.groupby(["city"]).size().reset_index(name='Number of people')

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

Write a Pandas program to delete DataFrame row(s) based on given column value

In [118]:
df = pd.DataFrame({'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]})

In [119]:
df.loc[df.loc[:, "col2"] != 5]

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

Write a Pandas program to widen output display to see more columns

In [120]:
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe

In [121]:
df.loc[1, "col1"] = np.nan

In [122]:
df

   col1  col2  col3
0   1.0     4     7
1   NaN     5     8
2   3.0     6     9
3   4.0     7     0
4   5.0     8     1

In [123]:
df.fillna(0)

   col1  col2  col3
0   1.0     4     7
1   0.0     5     8
2   3.0     6     9
3   4.0     7     0
4   5.0     8     1

Write a Pandas program to convert index in a column of the given dataframe

In [124]:
df.reset_index()

   index  col1  col2  col3
0      0   1.0     4     7
1      1   NaN     5     8
2      2   3.0     6     9
3      3   4.0     7     0
4      4   5.0     8     1

In [125]:
type(df.isna())

pandas.core.frame.DataFrame

In [126]:
x = df.isna()

In [127]:
x.sum()

col1    1
col2    0
col3    0
dtype: int64

Drop a list of rows from a specified DataFrame

In [128]:
df.drop(1, 0)

   col1  col2  col3
0   1.0     4     7
2   3.0     6     9
3   4.0     7     0
4   5.0     8     1

Write a Pandas program to divide a DataFrame in a given ratio

In [129]:
part_70 = df.sample(frac=0.7,random_state=10)
part_30 = df.drop(part_70.index)

In [130]:
part_70

   col1  col2  col3
2   3.0     6     9
3   4.0     7     0
0   1.0     4     7
4   5.0     8     1

In [131]:
part_30

   col1  col2  col3
1   NaN     5     8

Write a Pandas program to shuffle a given DataFrame rows

In [132]:
df.sample(frac=1)

   col1  col2  col3
1   NaN     5     8
3   4.0     7     0
0   1.0     4     7
4   5.0     8     1
2   3.0     6     9

 Write a Pandas program to convert DataFrame column type from string to datetime

In [133]:
df_time = pd.DataFrame({"date": ['3/11/2000', '3/12/2000', '3/13/2000']})

In [134]:
df_time.dtypes

date    object
dtype: object

In [135]:
df_time.loc[:, "date"] = pd.to_datetime(df_time.loc[:, "date"])

In [136]:
df_time.dtypes

date    datetime64[ns]
dtype: object

Write a Pandas program to find the row for where the value of a given column is maximum

In [137]:
# find row where col3 max
df

   col1  col2  col3
0   1.0     4     7
1   NaN     5     8
2   3.0     6     9
3   4.0     7     0
4   5.0     8     1

In [138]:
df.loc[df.loc[:, "col3"] == df.loc[:, "col3"].max()]

   col1  col2  col3
2   3.0     6     9

Write a Pandas program to append data to an empty DataFrame

In [139]:
empty_df = pd.DataFrame()
empty_df = empty_df.append(pd.DataFrame({"col1": [2.5], "col2": [1], "col3": [0]}), ignore_index=True)
# note append not in place
empty_df

   col1  col2  col3
0   2.5     1     0

Write a Pandas program to sort a given DataFrame by two or more columns

In [140]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, 34, 9, 20, 14.5, 2, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame:")
print(df)
print("\nSort the above DataFrame on attempts, name:")
df = df.sort_values(['attempts', 'name'], ascending=[True, True])
print(df)

Original DataFrame:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James   34.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    2.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Sort the above DataFrame on attempts, name:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
9      Jonas   19.0         1     yes
7      Laura    2.0         1      no
6    Matthew   14.5         1     yes
4      Emily    9.0         2      no
2  Katherine   16.5         2     yes
8      Kevin    8.0         2      no
1       Dima    9.0         3      no
3      James   34.0         3      no
5    Michael   20.0         3     yes

In [141]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, 34, 9, 20, 14.5, 2, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df.loc[:, "score"].astype(int, errors="raise")

0    12
1     9
2    16
3    34
4     9
5    20
6    14
7     2
8     8
9    19
Name: score, dtype: int32

Write a Pandas program to remove infinite values from a given DataFrame

In [142]:
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
df.replace([np.inf, -np.inf], np.nan)

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

Write a Pandas program to insert a given column at a specific column index in a DataFrame

In [143]:
df = pd.DataFrame({'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]})
new_col = [1, 2, 3, 4, 7]  
df

   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

In [144]:
df.insert(0, "col1", range(5))

In [145]:
df

   col1  col2  col3
0     0     4     7
1     1     5     8
2     2     6    12
3     3     9     1
4     4     5    11

Write a Pandas program to convert a given list of lists into a Dataframe

In [146]:
pd.DataFrame([[1, 2], [3, 4], [5, 6]], columns=["col1", "col2"])

   col1  col2
0     1     2
1     3     4
2     5     6

Write a Pandas program to group by the first column and get second column as lists in rows

In [147]:
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})

In [148]:
df.groupby('col1')['col2'].apply(list)

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

Write a Pandas program to get column index from column name of a given DataFrame

In [149]:
df = pd.DataFrame({'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]})

In [150]:
df.columns.get_loc('col1')

0

Write a Pandas program to get value of a column for the first row

In [151]:
df.iloc[0, df.columns.get_loc('col1')]

1

Write a Pandas program to select all columns, except one given column in a DataFrame

In [152]:
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [153]:
df.loc[:, [col for col in df.columns if col != "col1"]] # select cols directly

   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

In [154]:
df.loc[:, df.columns != "col1"] # boolean mask

   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

Write a Pandas program to get topmost n records within each group of a DataFrame

In [155]:
# nlargest is more performant than sort_values
print(df.nlargest(3, "col1"))
print(df.nlargest(3, "col2"))
print(df.nlargest(3, "col3"))

   col1  col2  col3
4     7     5    11
3     4     9     1
2     3     6    12
   col1  col2  col3
3     4     9     1
2     3     6    12
1     2     5     8
   col1  col2  col3
2     3     6    12
4     7     5    11
1     2     5     8

Write a Pandas program to remove last n rows of a given DataFrame

In [156]:
df.iloc[:-3] # remove last 3

   col1  col2  col3
0     1     4     7
1     2     5     8

Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame

In [157]:
df.add_prefix("_")

   _col1  _col2  _col3
0      1      4      7
1      2      5      8
2      3      6     12
3      4      9      1
4      7      5     11

In [158]:
df.add_suffix("_")

   col1_  col2_  col3_
0      1      4      7
1      2      5      8
2      3      6     12
3      4      9      1
4      7      5     11

Write a Pandas program to reverse order (rows, columns) of a given DataFrame

In [159]:
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [160]:
df.loc[:, ::-1]

   col3  col2  col1
0     7     4     1
1     8     5     2
2    12     6     3
3     1     9     4
4    11     5     7

In [161]:
df.loc[::-1]

   col1  col2  col3
4     7     5    11
3     4     9     1
2     3     6    12
1     2     5     8
0     1     4     7

Write a Pandas program to select columns by data type of a given DataFrame

In [162]:
df.select_dtypes('int64')

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Write a Pandas program to rename all columns with the same pattern of a given DataFrame

In [163]:
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [164]:
df.columns = ["_" + col.upper() for col in df.columns]

In [165]:
df

   _COL1  _COL2  _COL3
0      1      4      7
1      2      5      8
2      3      6     12
3      4      9      1
4      7      5     11

Write a Pandas program to merge datasets and check uniqueness

In [166]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df1 = df.copy(deep = True)
df = df.drop([0, 1])
df1 = df1.drop([2])
print("\nNew DataFrames:")
print(df)
print(df1)
print('\n"one_to_one: check if merge keys are unique in both left and right datasets:"')
df_one_to_one = pd.merge(df, df1, validate = "one_to_one")
print(df_one_to_one)
print('\n"one_to_many or 1:m: check if merge keys are unique in left dataset:')
df_one_to_many = pd.merge(df, df1, validate = "one_to_many")
print(df_one_to_many)
print('many_to_one or m:1: check if merge keys are unique in right dataset:')
df_many_to_one = pd.merge(df, df1, validate = "many_to_one")
print(df_many_to_one)

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

New DataFrames:
           Name Date_Of_Birth    Age
2   Ryan Parkes     25/09/1998  22.5
3  Eesha Hinton     11/05/2002  22.0
4  Syed Wharton     15/09/1997  23.0
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

"one_to_one: check if merge keys are unique in both left and right datasets:"
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

"one_to_many or 1:m: check if merge keys are unique in left dataset:
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0
many_to_one or m:1: check if merge keys are unique in right dataset:
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

Write a Pandas program to convert continuous values of a column in a given DataFrame to categorical

In [167]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
    'age': [18, 22, 85, 50, 80, 5]
})

In [168]:
pd.cut(df.loc[:, 'age'], bins = [0, 18, 65, 99], labels = ["kids", "adult", "elderly"])

0       kids
1      adult
2    elderly
3      adult
4    elderly
5       kids
Name: age, dtype: category
Categories (3, object): ['kids' < 'adult' < 'elderly']

Write a Pandas program to fill missing values in time series data

In [169]:
df = pd.DataFrame({"c1":[120, 130 ,140, 150, np.nan, 170], "c2":[7, np.nan, 10, np.nan, 5.5, 16.5]})

In [170]:
df

      c1    c2
0  120.0   7.0
1  130.0   NaN
2  140.0  10.0
3  150.0   NaN
4    NaN   5.5
5  170.0  16.5

In [171]:
df.interpolate()

      c1     c2
0  120.0   7.00
1  130.0   8.50
2  140.0  10.00
3  150.0   7.75
4  160.0   5.50
5  170.0  16.50

Write a Pandas program to clean object column with mixed data of a given DataFrame using regular expression

In [172]:
d = {"agent": ["a001", "a002", "a003", "a003", "a004"], "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]}
df = pd.DataFrame(d)
print("Original dataframe:")
print(df)
print("\nData Types for purchase:")
print(df["purchase"].apply(type))
df["purchase"] = df["purchase"].replace("[$,]", "", regex = True).astype("float")
print("\nNew Data Types:")
print(df["purchase"].apply(type))

Original dataframe:
  agent  purchase
0  a001      4500
1  a002      7500
2  a003  $3000.25
3  a003  $1250.35
4  a004   9000.00

Data Types for purchase:
0    <class 'float'>
1    <class 'float'>
2      <class 'str'>
3      <class 'str'>
4      <class 'str'>
Name: purchase, dtype: object

New Data Types:
0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
4    <class 'float'>
Name: purchase, dtype: object

Write a Pandas program to get the numeric representation of an array by identifying distinct values of a given column of a DataFrame

In [173]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
label1, unique1 = pd.factorize(df['Name'])
print("\nNumeric representation of an array by identifying distinct values:")
print(label1)
print(unique1)

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Gino Mcneill     15/09/1997  23.0

Numeric representation of an array by identifying distinct values:
[0 1 2 3 1]
Index(['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton'], dtype='object')

Replace current value in a dataframe column based on last largest value

In [174]:
df = pd.DataFrame({'rnum':[23, 21, 27, 22, 34, 33, 34, 31, 25, 22, 34, 19, 31, 32, 19]})
df

    rnum
0     23
1     21
2     27
3     22
4     34
5     33
6     34
7     31
8     25
9     22
10    34
11    19
12    31
13    32
14    19

In [175]:
df.loc[df.loc[:, "rnum"] != df.loc[:, "rnum"].cummax(), "rnum"] = 0

## Joining and Merging DF

In [176]:
df1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

df2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

Write a Pandas program to join the two given dataframes along columns and assign all data

In [177]:
pd.concat([df1, df2], axis=1)

  student_id              name  marks student_id              name  marks
0         S1  Danniella Fenton    200         S4  Scarlette Fisher    201
1         S2      Ryder Storey    210         S5  Carla Williamson    200
2         S3      Bryce Jensen    190         S6       Dante Morse    198
3         S4         Ed Bernal    222         S7    Kaiser William    219
4         S5       Kwame Morin    199         S8   Madeeha Preston    201

Write a Pandas program to join the two given dataframes along rows and assign all data

In [178]:
pd.concat([df1, df2], axis=0)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

Write a Pandas program to append Series to an existing DataFrame and display the combined data

In [179]:
df = df1
df

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [180]:
s6 = pd.Series(['S6', 'Scarlette Fisher', 205], index=['student_id', 'name', 'marks'])
df.append(s6, ignore_index=True)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S6  Scarlette Fisher    205

Write a Pandas program to append a list of dictioneries or series to a existing DataFrame and display the combined data

In [181]:
# can append dict + series at the same time w/ append(list)
s7 = {"student_id": 'S7', "name": "Johny DU", "marks": 75}
s8 = {"student_id": 'S8', "name": "Johny DUE", "marks": 76}
df.append([s7, s8], ignore_index=True)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S7          Johny DU     75
6         S8         Johny DUE     76

Write a Pandas program to join the two given dataframes along rows and merge with another dataframe along the common column id

In [182]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

exam_data = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})

print("Original DataFrames:")
print(student_data1)
print(student_data2)
print(exam_data)

print("\nJoin first two said dataframes along rows:")
result_data = pd.concat([student_data1, student_data2])
print(result_data)

print("\nNow join the said result_data and df_exam_data along student_id:")
final_merged_data = pd.merge(result_data, exam_data, on='student_id') # default is inner
print(final_merged_data)

Original DataFrames:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201
   student_id  exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12

Join first two said dataframes along rows:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

Now join the said result_data and df_exam_data along student_id:
  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4         Ed Bernal    222       67
4         S4  Scarlette Fisher    201       67
5         S5       Kwame Morin    199       21
6         S5  Carla Williamson    200       21
7         S7    Kaiser William    219       55
8         S8   Madeeha Preston    201       33

Write a Pandas program to join (left join) the two dataframes using keys from left dataframe only

In [183]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})
print("Original DataFrames:")
print(data1)
print("--------------------")
print(data2)
print("\nMerged Data (keys from data1):")
merged_data = pd.merge(data1, data2, how='left', on=['key1', 'key2'])
print(merged_data)
print("\nMerged Data (keys from data2):")
merged_data = pd.merge(data2, data1, how='left', on=['key1', 'key2'])
print(merged_data)

Original DataFrames:
  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3
--------------------
  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3

Merged Data (keys from data1):
  key1 key2   P   Q    R    S
0   K0   K0  P0  Q0   R0   S0
1   K0   K1  P1  Q1  NaN  NaN
2   K1   K0  P2  Q2   R1   S1
3   K1   K0  P2  Q2   R2   S2
4   K2   K1  P3  Q3  NaN  NaN

Merged Data (keys from data2):
  key1 key2   R   S    P    Q
0   K0   K0  R0  S0   P0   Q0
1   K1   K0  R1  S1   P2   Q2
2   K1   K0  R2  S2   P2   Q2
3   K2   K0  R3  S3  NaN  NaN

Write a Pandas program to create a new DataFrame based on existing series, using specified argument and override the existing columns names

In [184]:
s1 = pd.Series([0, 1, 2, 3], name='col1')
s2 = pd.Series([0, 1, 2, 3])
s3 = pd.Series([0, 1, 4, 5], name='col3')
pd.concat([s1, s2, s3], axis=1, keys=['column1', 'column2', 'column3'])

   column1  column2  column3
0        0        0        0
1        1        1        1
2        2        2        4
3        3        3        5

## Grouping and aggregating

Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object

In [185]:
pd.set_option('display.max_rows', None)
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

print("Original DataFrame:")
print(student_data)
print('\nSplit the said data on school_code wise:')
result = student_data.groupby(['school_code'])
for name,group in result:
    print("\nGroup:")
    print(name)
    print(group)
print("\nType of the object:")
print(type(result))

Original DataFrame:
   school_code class            name date_Of_Birth   age  height  weight  address
S1        s001     V  Alberto Franco     15/05/2002   12     173      35  street1
S2        s002     V    Gino Mcneill     17/05/2002   12     192      32  street2
S3        s003    VI     Ryan Parkes     16/02/1999   13     186      33  street3
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30  street1
S5        s002     V    Gino Mcneill     11/05/2002   14     151      31  street2
S6        s004    VI    David Parkes     15/09/1997   12     159      32  street4

Split the said data on school_code wise:

Group:
s001
   school_code class            name date_Of_Birth   age  height  weight  address
S1        s001     V  Alberto Franco     15/05/2002   12     173      35  street1
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30  street1

Group:
s002
   school_code class          name date_Of_Birth   age  height  weight  address
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32  street2
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31  street2

Group:
s003
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

Group:
s004
   school_code class          name date_Of_Birth   age  height  weight  address
S6        s004    VI  David Parkes     15/09/1997   12     159      32  street4

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Split the specified given dataframe by school code and get mean, min, and max value of age for each school

In [186]:
student_data.groupby('school_code').agg({'age': ['mean', 'min', 'max']})

              age
             mean min max
school_code
s001         12.5  12  13
s002         13.0  12  14
s003         13.0  13  13
s004         12.0  12  12

Write a Pandas program to split the following given dataframe into groups based on school code and call a specific group with the name of the group

In [187]:
student_data

   school_code class            name date_Of_Birth   age  height  weight  address
S1        s001     V  Alberto Franco     15/05/2002   12     173      35  street1
S2        s002     V    Gino Mcneill     17/05/2002   12     192      32  street2
S3        s003    VI     Ryan Parkes     16/02/1999   13     186      33  street3
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30  street1
S5        s002     V    Gino Mcneill     11/05/2002   14     151      31  street2
S6        s004    VI    David Parkes     15/09/1997   12     159      32  street4

In [188]:
student_data.groupby('school_code').get_group('s001')

   school_code class            name date_Of_Birth   age  height  weight  address
S1        s001     V  Alberto Franco     15/05/2002   12     173      35  street1
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30  street1

Write a Pandas program to split a dataset to group by two columns and count by each row

In [189]:
#pd.set_option('display.max_columns', None)
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
print("Original Orders DataFrame:")
print(df)
print("\nGroup by two columns and count by each row:")
df.groupby(['salesman_id','customer_id']).agg('count')

Original Orders DataFrame:
    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

Group by two columns and count by each row:

                         ord_no  purch_amt  ord_date
salesman_id customer_id
5001        3002              3          3         3
            3007              1          1         1
5002        3005              2          2         2
            3008              1          1         1
5003        3009              2          2         2
5005        3001              1          1         1
5006        3004              1          1         1
5007        3003              1          1         1

Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups.

In [190]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

In [191]:
t = df.groupby(['customer_id', 'salesman_id']).agg({'purch_amt': sum})
t

                         purch_amt
customer_id salesman_id
3001        5005            270.65
3002        5001           8870.86
3003        5007             75.29
3004        5006           1983.43
3005        5002           1099.00
3007        5001           2400.60
3008        5002            250.45
3009        5003           2590.90

In [192]:
t['purch_amt'].groupby(level=0, group_keys=False).nlargest()

customer_id  salesman_id
3001         5005            270.65
3002         5001           8870.86
3003         5007             75.29
3004         5006           1983.43
3005         5002           1099.00
3007         5001           2400.60
3008         5002            250.45
3009         5003           2590.90
Name: purch_amt, dtype: float64

## Indexing

Write a Pandas program to display the default index and set a column as an Index in a given dataframe.

In [193]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

In [194]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [195]:
df.set_index('school_code')

            class            name date_Of_Birth  weight  address t_id
school_code
s001            V  Alberto Franco    15/05/2002      35  street1   t1
s002            V    Gino Mcneill    17/05/2002      32  street2   t2
s003           VI     Ryan Parkes    16/02/1999      33  street3   t3
s001           VI    Eesha Hinton    25/09/1998      30  street1   t4
s002            V    Gino Mcneill    11/05/2002      31  street2   t5
s004           VI    David Parkes    15/09/1997      32  street4   t6

Write a Pandas program to create a multi Index frame using two columns and using an Index and a column.

In [196]:
df.set_index(['t_id', 'school_code'])

                 class            name date_Of_Birth  weight  address
t_id school_code
t1   s001            V  Alberto Franco    15/05/2002      35  street1
t2   s002            V    Gino Mcneill    17/05/2002      32  street2
t3   s003           VI     Ryan Parkes    16/02/1999      33  street3
t4   s001           VI    Eesha Hinton    25/09/1998      30  street1
t5   s002            V    Gino Mcneill    11/05/2002      31  street2
t6   s004           VI    David Parkes    15/09/1997      32  street4

Write a Pandas program to create a DataFrame using intervals as an index.

In [197]:
print("Create an Interval Index using IntervalIndex.from_breaks:")
df_interval = pd.DataFrame({"X":[1, 2, 3, 4, 5, 6, 7]},
                            index = pd.IntervalIndex.from_breaks(
                            [0, 0.5, 1.0, 1.5, 2.0, 2.5, 3, 3.5]))    
print(df_interval)
print(df_interval.index)

print("\nCreate an Interval Index using IntervalIndex.from_tuples:")
df_interval = pd.DataFrame({"X":[1, 2, 3, 4, 5, 6, 7]},             
                            index = pd.IntervalIndex.from_tuples(
                            [(0, .5), (.5, 1), (1, 1.5), (1.5, 2), (2, 2.5), (2.5, 3), (3, 3.5)]))
print(df_interval)
print(df_interval.index)

print("\nCreate an Interval Index using IntervalIndex.from_arrays:")
df_interval = pd.DataFrame({"X":[1, 2, 3, 4, 5, 6, 7]},             
                            index = pd.IntervalIndex.from_arrays(
                            [0, .5, 1, 1.5, 2, 2.5, 3], [.5, 1, 1.5, 2, 2.5, 3, 3.5]))
print(df_interval)
print(df_interval.index)

Create an Interval Index using IntervalIndex.from_breaks:
            X
(0.0, 0.5]  1
(0.5, 1.0]  2
(1.0, 1.5]  3
(1.5, 2.0]  4
(2.0, 2.5]  5
(2.5, 3.0]  6
(3.0, 3.5]  7
IntervalIndex([(0.0, 0.5], (0.5, 1.0], (1.0, 1.5], (1.5, 2.0], (2.0, 2.5], (2.5, 3.0], (3.0, 3.5]],
              closed='right',
              dtype='interval[float64]')

Create an Interval Index using IntervalIndex.from_tuples:
            X
(0.0, 0.5]  1
(0.5, 1.0]  2
(1.0, 1.5]  3
(1.5, 2.0]  4
(2.0, 2.5]  5
(2.5, 3.0]  6
(3.0, 3.5]  7
IntervalIndex([(0.0, 0.5], (0.5, 1.0], (1.0, 1.5], (1.5, 2.0], (2.0, 2.5], (2.5, 3.0], (3.0, 3.5]],
              closed='right',
              dtype='interval[float64]')

Create an Interval Index using IntervalIndex.from_arrays:
            X
(0.0, 0.5]  1
(0.5, 1.0]  2
(1.0, 1.5]  3
(1.5, 2.0]  4
(2.0, 2.5]  5
(2.5, 3.0]  6
(3.0, 3.5]  7
IntervalIndex([(0.0, 0.5], (0.5, 1.0], (1.0, 1.5], (1.5, 2.0], (2.0, 2.5], (2.5, 3.0], (3.0, 3.5]],
              closed='right',
              dtype='interval[float64]')

Write a Pandas program to create a dataframe and set a title or name of the index column.

In [198]:
df.index.name = "myIndex"

In [199]:
df.index

RangeIndex(start=0, stop=6, step=1, name='myIndex')

Write a Pandas program to convert 1st and 3rd levels in the index into columns from a multiple level of index frame of a given dataframe.

In [200]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})
print("Original DataFrame:")
print(df)
print("\nMultiIndex using columns 't_id', school_code and 'class':")
df1 = df.set_index(['t_id', 'school_code', 'class'])
print(df1)
print("\nConvert 1st and 3rd levels in the index frame into columns:")
df2 = df1.reset_index(level=['t_id', 'class'])
print(df2)

Original DataFrame:
  school_code class            name date_of_birth  weight t_id
0        s001     V  Alberto Franco    15/05/2002      35   t1
1        s002     V    Gino Mcneill    17/05/2002      32   t2
2        s003    VI     Ryan Parkes    16/02/1999      33   t3
3        s001    VI    Eesha Hinton    25/09/1998      30   t4
4        s002     V    Gino Mcneill    11/05/2002      31   t5
5        s004    VI    David Parkes    15/09/1997      32   t6

MultiIndex using columns 't_id', school_code and 'class':
                                  name date_of_birth  weight
t_id school_code class
t1   s001        V      Alberto Franco    15/05/2002      35
t2   s002        V        Gino Mcneill    17/05/2002      32
t3   s003        VI        Ryan Parkes    16/02/1999      33
t4   s001        VI       Eesha Hinton    25/09/1998      30
t5   s002        V        Gino Mcneill    11/05/2002      31
t6   s004        VI       David Parkes    15/09/1997      32

Convert 1st and 3rd levels in the index frame into columns:
            t_id class            name date_of_birth  weight
school_code
s001          t1     V  Alberto Franco    15/05/2002      35
s002          t2     V    Gino Mcneill    17/05/2002      32
s003          t3    VI     Ryan Parkes    16/02/1999      33
s001          t4    VI    Eesha Hinton    25/09/1998      30
s002          t5     V    Gino Mcneill    11/05/2002      31
s004          t6    VI    David Parkes    15/09/1997      32

Write a Pandas program to check if a specified value exists in single and multiple column index dataframe

In [201]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  ['t1', 't2', 't3', 't4', 't5', 't6'])
print("Original DataFrame with single index:")
print(df)
print("\nCheck a value is exist in single column index dataframe:")
print('t1' in df.index)
print('t11' in df.index)
print("\nCreate MultiIndex using columns 't_id', school_code and 'class':")
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})
df1 = df.set_index(['t_id', 'school_code', 'class'])
print(df1)
print("\nCheck a value is exist in multiple columns index dataframe:")
print('t4' in df1.index.levels[0])
print('t4' in df1.index.levels[1])
print('t4' in df1.index.levels[2])

Original DataFrame with single index:
   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s004    VI    David Parkes    15/09/1997      32

Check a value is exist in single column index dataframe:
True
False

Create MultiIndex using columns 't_id', school_code and 'class':
                                  name date_of_birth  weight
t_id school_code class
t1   s001        V      Alberto Franco    15/05/2002      35
t2   s002        V        Gino Mcneill    17/05/2002      32
t3   s003        VI        Ryan Parkes    16/02/1999      33
t4   s001        VI       Eesha Hinton    25/09/1998      30
t5   s002        V        Gino Mcneill    11/05/2002      31
t6   s004        VI       David Parkes    15/09/1997      32

Check a value is exist in multiple columns index dataframe:
True
False
False

In [202]:
df1.loc[('t1', ['s001', 's002']), :]

                                  name date_of_birth  weight
t_id school_code class
t1   s001        V      Alberto Franco    15/05/2002      35

Write a Pandas program to construct a series using the MultiIndex levels as the column and index

In [203]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]
sales_tuples = list(zip(*sales_arrays))
print("Create a MultiIndex:")
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
print(sales_tuples)
print("\nConstruct a series using the said MultiIndex levels: ")
s = pd.Series(np.random.randn(8), index = sales_index)
print(s)

Create a MultiIndex:
[('sale1', 'city1'), ('sale1', 'city2'), ('sale2', 'city1'), ('sale2', 'city2'), ('sale3', 'city1'), ('sale3', 'city2'), ('sale4', 'city1'), ('sale4', 'city2')]

Construct a series using the said MultiIndex levels:
sale   city
sale1  city1   -0.382327
       city2    1.016246
sale2  city1   -1.601740
       city2    0.819386
sale3  city1    1.148605
       city2    0.478849
sale4  city1    1.103949
       city2    0.286408
dtype: float64

Write a Pandas program to construct a dataframe using the MultiIndex levels as the column and index

In [204]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]
sales_tuples = list(zip(*sales_arrays))
print("Create a MultiIndex:")
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
print(sales_tuples)
print("\nConstruct a Dataframe using the said MultiIndex levels: ")
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
print(df)

Create a MultiIndex:
[('sale1', 'city1'), ('sale1', 'city2'), ('sale2', 'city1'), ('sale2', 'city2'), ('sale3', 'city1'), ('sale3', 'city2'), ('sale4', 'city1'), ('sale4', 'city2')]

Construct a Dataframe using the said MultiIndex levels:
                    0         1         2         3         4
sale  city
sale1 city1  0.325179  0.049713  0.373987 -0.759351 -0.807244
      city2 -0.615854 -0.972825 -0.787455  0.692767 -0.120186
sale2 city1  1.477885  0.016437  0.198062 -0.182567 -0.134812
      city2 -0.374994 -0.025330  1.242481  1.101269  0.966948
sale3 city1  0.921917  0.449236 -2.451317  0.603304  0.375019
      city2 -0.742623 -0.040619  0.019274 -0.685024 -2.129815
sale4 city1 -0.037119  0.132465  1.657735  0.141631 -1.229531
      city2  0.512455  1.930840  1.024530  1.102068 -1.481117

Write a Pandas program to rename names of columns and specific labels of the Main Index of the MultiIndex dataframe

In [205]:
df.rename(columns={0: "col1", 1: "col2", 2:"col3", 3:"col4", 4:"col5"})

                 col1      col2      col3      col4      col5
sale  city
sale1 city1  0.325179  0.049713  0.373987 -0.759351 -0.807244
      city2 -0.615854 -0.972825 -0.787455  0.692767 -0.120186
sale2 city1  1.477885  0.016437  0.198062 -0.182567 -0.134812
      city2 -0.374994 -0.025330  1.242481  1.101269  0.966948
sale3 city1  0.921917  0.449236 -2.451317  0.603304  0.375019
      city2 -0.742623 -0.040619  0.019274 -0.685024 -2.129815
sale4 city1 -0.037119  0.132465  1.657735  0.141631 -1.229531
      city2  0.512455  1.930840  1.024530  1.102068 -1.481117

In [206]:
df.rename(index={"sale2": "S2", "city2": "C2"})

                    0         1         2         3         4
sale  city
sale1 city1  0.325179  0.049713  0.373987 -0.759351 -0.807244
      C2    -0.615854 -0.972825 -0.787455  0.692767 -0.120186
S2    city1  1.477885  0.016437  0.198062 -0.182567 -0.134812
      C2    -0.374994 -0.025330  1.242481  1.101269  0.966948
sale3 city1  0.921917  0.449236 -2.451317  0.603304  0.375019
      C2    -0.742623 -0.040619  0.019274 -0.685024 -2.129815
sale4 city1 -0.037119  0.132465  1.657735  0.141631 -1.229531
      C2     0.512455  1.930840  1.024530  1.102068 -1.481117

Write a Pandas program to sort a MultiIndex of a DataFrame. Also sort on various levels of index.

In [207]:
sales_arrays = [['sale1', 'sale1', 'sale3', 'sale3', 'sale2', 'sale2', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]
sales_tuples = list(zip(*sales_arrays))
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
print(sales_tuples)
print("\nConstruct a Dataframe using the said MultiIndex levels: ")
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
print(df)
print("\nSort on MultiIndex DataFrame:")
df1 = df.sort_index()
print("\nSort on Index level=0 of the DataFrame:")
df2 = df.sort_index(level=0)
print(df2)
print("\nSort on Index level=1 of the DataFrame:")
df2 = df.sort_index(level=1)
print(df2)
print("\nPass a level name to sort the DataFrame:")
df3 = df.sort_index(level="city")
print(df3)

[('sale1', 'city1'), ('sale1', 'city2'), ('sale3', 'city1'), ('sale3', 'city2'), ('sale2', 'city1'), ('sale2', 'city2'), ('sale4', 'city1'), ('sale4', 'city2')]

Construct a Dataframe using the said MultiIndex levels:
                    0         1         2         3         4
sale  city
sale1 city1  0.637263 -0.279545  0.115077 -1.906125  0.003041
      city2  0.197513 -1.492714 -0.526126 -0.480096 -0.494117
sale3 city1 -1.374083  1.051676  0.383873 -1.023070 -0.037482
      city2  1.834570  0.927581  1.421566 -0.463922 -1.046919
sale2 city1  1.658208  1.441329 -1.367514  0.011592 -0.251912
      city2 -0.395012 -0.210151  0.365204  0.208492  0.266350
sale4 city1  1.149985 -0.717452  1.345444 -0.368919  0.170954
      city2 -1.128870 -0.355126 -1.007285  0.743614 -0.535159

Sort on MultiIndex DataFrame:

Sort on Index level=0 of the DataFrame:
                    0         1         2         3         4
sale  city
sale1 city1  0.637263 -0.279545  0.115077 -1.906125  0.003041
      city2  0.197513 -1.492714 -0.526126 -0.480096 -0.494117
sale2 city1  1.658208  1.441329 -1.367514  0.011592 -0.251912
      city2 -0.395012 -0.210151  0.365204  0.208492  0.266350
sale3 city1 -1.374083  1.051676  0.383873 -1.023070 -0.037482
      city2  1.834570  0.927581  1.421566 -0.463922 -1.046919
sale4 city1  1.149985 -0.717452  1.345444 -0.368919  0.170954
      city2 -1.128870 -0.355126 -1.007285  0.743614 -0.535159

Sort on Index level=1 of the DataFrame:
                    0         1         2         3         4
sale  city
sale1 city1  0.637263 -0.279545  0.115077 -1.906125  0.003041
sale2 city1  1.658208  1.441329 -1.367514  0.011592 -0.251912
sale3 city1 -1.374083  1.051676  0.383873 -1.023070 -0.037482
sale4 city1  1.149985 -0.717452  1.345444 -0.368919  0.170954
sale1 city2  0.197513 -1.492714 -0.526126 -0.480096 -0.494117
sale2 city2 -0.395012 -0.210151  0.365204  0.208492  0.266350
sale3 city2  1.834570  0.927581  1.421566 -0.463922 -1.046919
sale4 city2 -1.128870 -0.355126 -1.007285  0.743614 -0.535159

Pass a level name to sort the DataFrame:
                    0         1         2         3         4
sale  city
sale1 city1  0.637263 -0.279545  0.115077 -1.906125  0.003041
sale2 city1  1.658208  1.441329 -1.367514  0.011592 -0.251912
sale3 city1 -1.374083  1.051676  0.383873 -1.023070 -0.037482
sale4 city1  1.149985 -0.717452  1.345444 -0.368919  0.170954
sale1 city2  0.197513 -1.492714 -0.526126 -0.480096 -0.494117
sale2 city2 -0.395012 -0.210151  0.365204  0.208492  0.266350
sale3 city2  1.834570  0.927581  1.421566 -0.463922 -1.046919
sale4 city2 -1.128870 -0.355126 -1.007285  0.743614 -0.535159

Write a Pandas program to find the indexes of rows of a specified value of a given column in a DataFrame.

In [208]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  [1, 2, 3, 4, 5, 6])
print("Original DataFrame with single index:")
print(df)
print("\nIndex of rows where specified column matches certain value:")
print(df.index[df['school_code']=='s001'].tolist())

Original DataFrame with single index:
  school_code class            name date_of_birth  weight
1        s001     V  Alberto Franco    15/05/2002      35
2        s002     V    Gino Mcneill    17/05/2002      32
3        s003    VI     Ryan Parkes    16/02/1999      33
4        s001    VI    Eesha Hinton    25/09/1998      30
5        s002     V    Gino Mcneill    11/05/2002      31
6        s004    VI    David Parkes    15/09/1997      32

Index of rows where specified column matches certain value:
[1, 4]

Write a Pandas program to find integer index of rows with missing data in a given dataframe

In [209]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
print("Original DataFrame:")
print(df)
index = df.index[df['weight'].apply(np.isnan)]
print(index)
df_index = df.index.values.tolist()
print(df_index)
print("\nInteger index of rows with missing data in 'weight' column of the said dataframe:")
print([df_index.index(i) for i in index])

Original DataFrame:
   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002    35.0
t2        s002     V    Gino Mcneill    17/05/2002     NaN
t3        s003    VI     Ryan Parkes    16/02/1999    33.0
t4        s001    VI    Eesha Hinton    25/09/1998    30.0
t5        s002     V    Gino Mcneill    11/05/2002    31.0
t6        s004    VI    David Parkes    15/09/1997     NaN
Index(['t2', 't6'], dtype='object')
['t1', 't2', 't3', 't4', 't5', 't6']

Integer index of rows with missing data in 'weight' column of the said dataframe:
[1, 5]

Write a Pandas program to start index with different value rather than 0 in a given DataFrame

In [210]:
df.index

Index(['t1', 't2', 't3', 't4', 't5', 't6'], dtype='object')

In [211]:
df.index += "_"

In [212]:
df.index

Index(['t1_', 't2_', 't3_', 't4_', 't5_', 't6_'], dtype='object')

## String

Write a Pandas program to convert all the string values to upper, lower cases in a given pandas series. Also find the length of the string values

In [213]:
s = pd.Series(['X', 'Y', 'Z', 'Aaba', 'Baca', np.nan, 'CABA', None, 'bird', 'horse', 'dog'])
print("Original series:")
print(s)
print("\nConvert all string values of the said Series to upper case:")
print(s.str.upper())
print("\nConvert all string values of the said Series to lower case:")
print(s.str.lower())
print("\nLength of the string values of the said Series:")
print(s.str.len())

Original series:
0         X
1         Y
2         Z
3      Aaba
4      Baca
5       NaN
6      CABA
7      None
8      bird
9     horse
10      dog
dtype: object

Convert all string values of the said Series to upper case:
0         X
1         Y
2         Z
3      AABA
4      BACA
5       NaN
6      CABA
7      None
8      BIRD
9     HORSE
10      DOG
dtype: object

Convert all string values of the said Series to lower case:
0         x
1         y
2         z
3      aaba
4      baca
5       NaN
6      caba
7      None
8      bird
9     horse
10      dog
dtype: object

Length of the string values of the said Series:
0     1.0
1     1.0
2     1.0
3     4.0
4     4.0
5     NaN
6     4.0
7     NaN
8     4.0
9     5.0
10    3.0
dtype: float64

Write a Pandas program to remove whitespaces, left sided whitespaces and right sided whitespaces of the string values of a given pandas series.

In [214]:
color1 = pd.Index([' Green', 'Black ', ' Red ', 'White', ' Pink '])
print("Original series:")
print(color1)
print("\nRemove whitespace")
print(color1.str.strip())
print("\nRemove left sided whitespace")
print(color1.str.lstrip())
print("\nRemove Right sided whitespace")
print(color1.str.rstrip())

Original series:
Index([' Green', 'Black ', ' Red ', 'White', ' Pink '], dtype='object')

Remove whitespace
Index(['Green', 'Black', 'Red', 'White', 'Pink'], dtype='object')

Remove left sided whitespace
Index(['Green', 'Black ', 'Red ', 'White', 'Pink '], dtype='object')

Remove Right sided whitespace
Index([' Green', 'Black', ' Red', 'White', ' Pink'], dtype='object')

Write a Pandas program to add leading zeros to the integer column in a pandas series and makes the length of the field to 8 digit.

In [215]:
nums = {'amount': [10, 250, 3000, 40000, 500000]}
print("Original dataframe:")
df = pd.DataFrame(nums)
print(df)
print("\nAdd leading zeros:")
df['amount'] = df['amount'].apply(lambda x: '{0:0>8}'.format(x))
print(df)

Original dataframe:
   amount
0      10
1     250
2    3000
3   40000
4  500000

Add leading zeros:
     amount
0  00000010
1  00000250
2  00003000
3  00040000
4  00500000

Write a Pandas program to capitalize all the string values of specified columns of a given DataFrame

In [216]:
df = pd.DataFrame({
    'name': ['alberto','gino','ryan', 'Eesha', 'syed'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
print("\nAfter capitalizing name column:")
df['name'] = list(map(lambda x: x.capitalize(), df['name']))
print(df)

Original DataFrame:
      name date_of_birth    age
0  alberto     17/05/2002  18.5
1     gino     16/02/1999  21.2
2     ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     syed     15/09/1997  23.0

After capitalizing name column:
      name date_of_birth    age
0  Alberto     17/05/2002  18.5
1     Gino     16/02/1999  21.2
2     Ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     Syed     15/09/1997  23.0

Write a Pandas program to count of occurrence of a specified substring in a DataFrame column

In [217]:
df = pd.DataFrame({
    'name_code': ['c001','c002','c022', 'c2002', 'c2222'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
print("\nCount occurrence of 2 in date_of_birth column:")
df['count'] = df['name_code'].apply(lambda x: x.count("2")) # doesn't count overlapping
print(df)

Original DataFrame:
  name_code date_of_birth    age
0      c001     12/05/2002  18.5
1      c002     16/02/1999  21.2
2      c022     25/09/1998  22.5
3     c2002     12/02/2022  22.0
4     c2222     15/09/1997  23.0

Count occurrence of 2 in date_of_birth column:
  name_code date_of_birth    age  count
0      c001     12/05/2002  18.5      0
1      c002     16/02/1999  21.2      1
2      c022     25/09/1998  22.5      2
3     c2002     12/02/2022  22.0      2
4     c2222     15/09/1997  23.0      4

In [218]:
# Python string functions
# islower, isupper, isalpha, isalnum, isnumeric, isspace, startswith, swapcase, upper, lower, title

Write a Pandas program to replace more than one value with other values in a given DataFrame

In [219]:
df = pd.DataFrame({
    'company_code': ['A','B', 'C', 'D', 'A'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})

print("Original DataFrame:")
print(df)

print("\nReplace A with c:")
df = df.replace(["A", "D"], ["X", "Y"])
print(df)

Original DataFrame:
  company_code date_of_sale  sale_amount
0            A   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            A   15/09/1997         23.0

Replace A with c:
  company_code date_of_sale  sale_amount
0            X   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            Y   12/02/2022    2566552.0
4            X   15/09/1997         23.0

Split a string of a column of a given DataFrame into multiple columns

In [220]:
df = pd.DataFrame({
    'name': ['Alberto  Franco','Gino Ann Mcneill','Ryan  Parkes', 'Eesha Artur Hinton', 'Syed  Wharton'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df[["first", "middle", "last"]] = df["name"].str.split(" ", expand = True)
print("\nNew DataFrame:")
print(df)

Original DataFrame:
                 name date_of_birth    age
0     Alberto  Franco     17/05/2002  18.5
1    Gino Ann Mcneill     16/02/1999  21.2
2        Ryan  Parkes     25/09/1998  22.5
3  Eesha Artur Hinton     11/05/2002  22.0
4       Syed  Wharton     15/09/1997  23.0

New DataFrame:
                 name date_of_birth    age    first middle     last
0     Alberto  Franco     17/05/2002  18.5  Alberto          Franco
1    Gino Ann Mcneill     16/02/1999  21.2     Gino    Ann  Mcneill
2        Ryan  Parkes     25/09/1998  22.5     Ryan          Parkes
3  Eesha Artur Hinton     11/05/2002  22.0    Eesha  Artur   Hinton
4       Syed  Wharton     15/09/1997  23.0     Syed         Wharton

Write a Pandas program to extract hash attached word from twitter text from the specified column of a given DataFrame

In [221]:
df = pd.DataFrame({
    'tweets': ['#Obama says goodbye','Retweets for #cash','A political endorsement in #Indonesia', '1 dog = many #retweets', 'Just a simple #egg']
    })
print("Original DataFrame:")
print(df)
def find_hash(text):
    hword=re.findall(r'(?<=#)\w+',text)
    return " ".join(hword)
df['hash_word']=df['tweets'].apply(lambda x: find_hash(x))
print("\Extracting#@word from dataframe columns:")
print(df)

Original DataFrame:
                                  tweets
0                    #Obama says goodbye
1                     Retweets for #cash
2  A political endorsement in #Indonesia
3                 1 dog = many #retweets
4                     Just a simple #egg
\Extracting#@word from dataframe columns:
                                  tweets  hash_word
0                    #Obama says goodbye      Obama
1                     Retweets for #cash       cash
2  A political endorsement in #Indonesia  Indonesia
3                 1 dog = many #retweets   retweets
4                     Just a simple #egg        egg

Write a Pandas program to extract email from a specified column of string type of a given DataFrame

In [222]:
df = pd.DataFrame({
    'name_email': ['Alberto Franco af@gmail.com','Gino Mcneill gm@yahoo.com','Ryan Parkes rp@abc.io', 'Eesha Hinton', 'Gino Mcneill gm@github.com']
    })
print("Original DataFrame:")
print(df)
def find_email(text):
    email = re.findall(r'[\w\.-]+@[\w\.-]+',str(text))
    return ",".join(email)
df['email']=df['name_email'].apply(lambda x: find_email(x))
print("\Extracting email from dataframe columns:")
print(df)

Original DataFrame:
                    name_email
0  Alberto Franco af@gmail.com
1    Gino Mcneill gm@yahoo.com
2        Ryan Parkes rp@abc.io
3                 Eesha Hinton
4   Gino Mcneill gm@github.com
\Extracting email from dataframe columns:
                    name_email          email
0  Alberto Franco af@gmail.com   af@gmail.com
1    Gino Mcneill gm@yahoo.com   gm@yahoo.com
2        Ryan Parkes rp@abc.io      rp@abc.io
3                 Eesha Hinton
4   Gino Mcneill gm@github.com  gm@github.com

Write a Pandas program to extract only number from the specified column of a given DataFrame.

In [223]:
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'address': ['7277 Surrey Ave.','920 N. Bishop Ave.','9910 Golden Star St.', '25 Dunbar St.', '17 West Livingston Court']
    })
print("Original DataFrame:")
print(df)
def find_number(text):
    num = re.findall(r'[0-9]+',text)
    return " ".join(num)
df['number']=df['address'].apply(lambda x: find_number(x))
print("\Extracting numbers from dataframe columns:")
print(df)

Original DataFrame:
  company_code                   address
0        c0001          7277 Surrey Ave.
1        c0002        920 N. Bishop Ave.
2        c0003      9910 Golden Star St.
3        c0003             25 Dunbar St.
4        c0004  17 West Livingston Court
\Extracting numbers from dataframe columns:
  company_code                   address number
0        c0001          7277 Surrey Ave.   7277
1        c0002        920 N. Bishop Ave.    920
2        c0003      9910 Golden Star St.   9910
3        c0003             25 Dunbar St.     25
4        c0004  17 West Livingston Court     17

Write a Pandas program to extract year between 1800 to 2200 from the specified column of a given DataFrame.

In [224]:
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'year': ['year 1800','year 1700','year 2300', 'year 1900', 'year 2200']
    })
print("Original DataFrame:")
print(df)
def find_year(text):
    #line=re.findall(r"\b(18[0][0]|2[0-2][00])\b",text)
    result = re.findall(r"\b(18[0-9]{2}|19[0-8][0-9]|199[0-9]|2[01][0-9]{2}|2200)\b",text)
    return result
df['year_range']=df['year'].apply(lambda x: find_year(x))
print("\Extracting year between 1800 to 2200:")
print(df)

Original DataFrame:
  company_code       year
0        c0001  year 1800
1        c0002  year 1700
2        c0003  year 2300
3        c0003  year 1900
4        c0004  year 2200
\Extracting year between 1800 to 2200:
  company_code       year year_range
0        c0001  year 1800     [1800]
1        c0002  year 1700         []
2        c0003  year 2300         []
3        c0003  year 1900     [1900]
4        c0004  year 2200     [2200]

## Datetime

In [225]:
import datetime
from datetime import datetime
print("Datetime object for Jan 11 2012:")
print(datetime(2012, 1, 11))
print("\nSpecific date and time of 9:20 pm") 
print(datetime(2011, 1, 11, 21, 20))
print("\nLocal date and time:")
print(datetime.now())
print("\nA date without time: ")
print(datetime.date(datetime(2012, 5, 22)))
print("\nCurrent date:")
print(datetime.now().date())
print("\nTime from a datetime:")
print(datetime.time(datetime(2012, 12, 15, 18, 12)))
print("\nCurrent local time:") 
print(datetime.now().time())

Datetime object for Jan 11 2012:
2012-01-11 00:00:00

Specific date and time of 9:20 pm
2011-01-11 21:20:00

Local date and time:
2020-09-07 00:51:07.475909

A date without time:
2012-05-22

Current date:
2020-09-07

Time from a datetime:
18:12:00

Current local time:
00:51:07.475909

Write a Pandas program to create a time series object that has time indexed data. Also select the dates of same year and select the dates between certain dates

In [226]:
index = pd.DatetimeIndex(['2011-09-02', '2012-08-04',
                          '2015-09-03', '2010-08-04',
                          '2015-03-03', '2011-08-04',
                          '2015-04-03', '2012-08-04'])

s_dates = pd.Series([0, 1, 2, 3, 4, 5, 6, 7], index=index)

print("Time series object with indexed data:")
print(s_dates)
print("\nDates of same year:")
print(s_dates['2015'])
print("\nDates between 2012-01-01 and 2012-12-31")
print(s_dates['2012-01-01':'2012-12-31'])

Time series object with indexed data:
2011-09-02    0
2012-08-04    1
2015-09-03    2
2010-08-04    3
2015-03-03    4
2011-08-04    5
2015-04-03    6
2012-08-04    7
dtype: int64

Dates of same year:
2015-09-03    2
2015-03-03    4
2015-04-03    6
dtype: int64

Dates between 2012-01-01 and 2012-12-31
2012-08-04    1
2012-08-04    7
dtype: int64

Pandas date range

In [227]:
date_range = pd.date_range('2020-01-01', periods=45)
print("Date range of perods 45:")
print(date_range)

Date range of perods 45:
DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04', '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12', '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16', '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23', '2020-01-24', '2020-01-25', '2020-01-26', '2020-01-27', '2020-01-28', '2020-01-29', '2020-01-30', '2020-01-31', '2020-02-01', '2020-02-02', '2020-02-03', '2020-02-04', '2020-02-05', '2020-02-06', '2020-02-07', '2020-02-08', '2020-02-09', '2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13', '2020-02-14'], dtype='datetime64[ns]', freq='D')

max and min works for dates

In [228]:
dates = pd.Series(pd.date_range('2020-12-01',periods=31, freq='D'))
print("Month of December 2020:")
print(dates)
dates = pd.Series(pd.date_range('2020-12-01',periods=31, freq='D'))
print("\nMaximum date: ", dates.max())
print("Minimum date: ", dates.min())
print("Maximum index: ", dates.idxmax())
print("Minimum index: ", dates.idxmin())

Month of December 2020:
0    2020-12-01
1    2020-12-02
2    2020-12-03
3    2020-12-04
4    2020-12-05
5    2020-12-06
6    2020-12-07
7    2020-12-08
8    2020-12-09
9    2020-12-10
10   2020-12-11
11   2020-12-12
12   2020-12-13
13   2020-12-14
14   2020-12-15
15   2020-12-16
16   2020-12-17
17   2020-12-18
18   2020-12-19
19   2020-12-20
20   2020-12-21
21   2020-12-22
22   2020-12-23
23   2020-12-24
24   2020-12-25
25   2020-12-26
26   2020-12-27
27   2020-12-28
28   2020-12-29
29   2020-12-30
30   2020-12-31
dtype: datetime64[ns]

Maximum date:  2020-12-31 00:00:00
Minimum date:  2020-12-01 00:00:00
Maximum index:  30
Minimum index:  0

freq is used to adjust interval

In [229]:
time_series = pd.date_range('1/1/2021', periods = 36, freq='3M')
print("Time series using three months frequency:")
print(time_series)

Time series using three months frequency:
DatetimeIndex(['2021-01-31', '2021-04-30', '2021-07-31', '2021-10-31', '2022-01-31', '2022-04-30', '2022-07-31', '2022-10-31', '2023-01-31', '2023-04-30', '2023-07-31', '2023-10-31', '2024-01-31', '2024-04-30', '2024-07-31', '2024-10-31', '2025-01-31', '2025-04-30', '2025-07-31', '2025-10-31', '2026-01-31', '2026-04-30', '2026-07-31', '2026-10-31', '2027-01-31', '2027-04-30', '2027-07-31', '2027-10-31', '2028-01-31', '2028-04-30', '2028-07-31', '2028-10-31', '2029-01-31', '2029-04-30', '2029-07-31', '2029-10-31'], dtype='datetime64[ns]', freq='3M')

Write a Pandas program to convert year and day of year into a single datetime column of a dataframe.

In [230]:
# https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_datetime.html
data = {\
"year": [2002, 2003, 2015, 2018],
"day_of_the_year": [250, 365, 1, 140]
}
df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)
df["combined"] = df["year"]*1000 + df["day_of_the_year"]
df["date"] = pd.to_datetime(df["combined"], format = "%Y%j")
print("\nNew DataFrame:")
print(df)

Original DataFrame:
   year  day_of_the_year
0  2002              250
1  2003              365
2  2015                1
3  2018              140

New DataFrame:
   year  day_of_the_year  combined       date
0  2002              250   2002250 2002-09-07
1  2003              365   2003365 2003-12-31
2  2015                1   2015001 2015-01-01
3  2018              140   2018140 2018-05-20

## Filter

In [231]:
import requests
import io
url = "https://www.w3resource.com/python-exercises/pandas/filter/world_alcohol.php"
s = requests.get(url).content
df = pd.read_csv(io.StringIO(s[7:].decode('utf-8')), header=None)
df.columns = df.iloc[0]
df = df.iloc[1:len(df)-1].reset_index(drop=True)
df.head(20)

0   Year             WHO region                           Country Beverage Types Display Value
0   1986        Western Pacific                          Viet Nam           Wine             0
1   1986               Americas                           Uruguay          Other           0.5
2   1985                 Africa                      Cte d'Ivoire           Wine          1.62
3   1986               Americas                          Colombia           Beer          4.27
4   1987               Americas             Saint Kitts and Nevis           Beer          1.98
5   1987               Americas                         Guatemala          Other             0
6   1987                 Africa                         Mauritius           Wine          0.13
7   1985                 Africa                            Angola        Spirits          0.39
8   1986               Americas               Antigua and Barbuda        Spirits          1.55
9   1984                 Africa                           Nigeria          Other           6.1
10  1987                 Africa                          Botswana           Wine           0.2
11  1989               Americas                         Guatemala           Beer          0.62
12  1985        Western Pacific  Lao People's Democratic Republic           Beer             0
13  1984  Eastern Mediterranean                       Afghanistan          Other             0
14  1985        Western Pacific                          Viet Nam        Spirits          0.05
15  1987                 Africa                     Guinea-Bissau           Wine          0.07
16  1984               Americas                        Costa Rica           Wine          0.06
17  1989                 Africa                        Seychelles           Beer          2.23
18  1984                 Europe                            Norway        Spirits          1.62
19  1984                 Africa                             Kenya           Beer          1.08

Remove na

In [232]:
df.isna().sum()

0
Year              0
WHO region        0
Country           0
Beverage Types    0
Display Value     5
dtype: int64

In [233]:
df.dropna()

0   Year             WHO region                                            Country Beverage Types Display Value
0   1986        Western Pacific                                           Viet Nam           Wine             0
1   1986               Americas                                            Uruguay          Other           0.5
2   1985                 Africa                                       Cte d'Ivoire           Wine          1.62
3   1986               Americas                                           Colombia           Beer          4.27
4   1987               Americas                              Saint Kitts and Nevis           Beer          1.98
5   1987               Americas                                          Guatemala          Other             0
6   1987                 Africa                                          Mauritius           Wine          0.13
7   1985                 Africa                                             Angola        Spirits          0.39
8   1986               Americas                                Antigua and Barbuda        Spirits          1.55
9   1984                 Africa                                            Nigeria          Other           6.1
10  1987                 Africa                                           Botswana           Wine           0.2
11  1989               Americas                                          Guatemala           Beer          0.62
12  1985        Western Pacific                   Lao People's Democratic Republic           Beer             0
13  1984  Eastern Mediterranean                                        Afghanistan          Other             0
14  1985        Western Pacific                                           Viet Nam        Spirits          0.05
15  1987                 Africa                                      Guinea-Bissau           Wine          0.07
16  1984               Americas                                         Costa Rica           Wine          0.06
17  1989                 Africa                                         Seychelles           Beer          2.23
18  1984                 Europe                                             Norway        Spirits          1.62
19  1984                 Africa                                              Kenya           Beer          1.08
20  1986        South-East Asia                                            Myanmar           Wine             0
21  1989               Americas                                         Costa Rica        Spirits          4.51
22  1984                 Europe                                            Romania        Spirits          2.67
23  1984                 Europe                                             Turkey           Beer          0.44
25  1984  Eastern Mediterranean                                            Tunisia          Other             0
26  1985                 Europe  United Kingdom of Great Britain and Northern I...           Wine          1.36
27  1984  Eastern Mediterranean                                            Bahrain           Beer          2.22
28  1987        Western Pacific                                           Viet Nam           Beer          0.11
30  1986                 Africa                                       Sierra Leone          Other          4.48
31  1986        Western Pacific                   Micronesia (Federated States of)           Wine             0
32  1989                 Africa                                          Mauritius           Beer           1.6
33  1985                 Africa                                         Mauritania          Other             0
34  1986                 Europe                                 Russian Federation           Wine           0.8
35  1985               Americas                              Saint Kitts and Nevis        Spirits          2.24
36  1987  Eastern Mediterranean                                              Egypt           Beer          0.07
37  1986                 Europe                                             Sweden           Beer          3.04
38  1987  Eastern Mediterranean                                              Qatar          Other             0
39  1987                 Africa                                       Burkina Faso        Spirits          0.01
40  1987                 Europe                                            Austria        Spirits           1.9
41  1986                 Europe                                     Czech Republic           Beer          6.82
42  1984                 Europe                                            Ukraine        Spirits          3.06
43  1984        Western Pacific                                              China           Wine          0.03
45  1989                 Africa                                           Zimbabwe           Beer          0.19
46  1987               Americas                                Trinidad and Tobago        Spirits          2.26
47  1986               Americas                                             Mexico          Other          0.04
48  1987               Americas                                          Nicaragua           Beer           0.7
49  1986                 Europe                                              Malta           Wine          1.49
50  1985                 Europe                                        Switzerland          Other           0.3
51  1987                 Europe                                            Finland           Beer          3.88
52  1986  Eastern Mediterranean                                       Saudi Arabia           Wine             0
53  1984  Eastern Mediterranean                                             Kuwait           Beer             0
54  1984               Americas                                        El Salvador        Spirits          1.81
55  1989               Americas                                           Suriname           Wine          0.04
56  1987        Western Pacific                                           Viet Nam           Wine             0
57  1989                 Europe                                            Croatia           Wine           5.1
58  1984  Eastern Mediterranean                                            Somalia        Spirits             0
59  1989  Eastern Mediterranean                               Syrian Arab Republic          Other             0
60  1987  Eastern Mediterranean                         Iran (Islamic Republic of)          Other             0
61  1984        Western Pacific                                   Papua New Guinea        Spirits          0.08
62  1987               Americas                                           Suriname          Other             0
63  1985  Eastern Mediterranean                                              Libya          Other             0
64  1989               Americas                   Bolivia (Plurinational State of)           Beer          1.26
65  1989  Eastern Mediterranean                                            Somalia           Beer             0
66  1987  Eastern Mediterranean                                               Iraq           Wine          0.01
67  1989                 Africa                                            Namibia           Beer             0
68  1989                 Africa                                             Uganda           Beer          0.12
69  1986                 Africa                                               Togo        Spirits          0.42
70  1986                 Africa                                         Madagascar        Spirits          1.02
71  1985                 Africa                                               Mali          Other          0.57
72  1987                 Africa                                         Mauritania          Other             0
73  1986  Eastern Mediterranean                                           Pakistan          Other          0.01
74  1986               Americas                   Bolivia (Plurinational State of)        Spirits          2.06
75  1989  Eastern Mediterranean                                        Afghanistan          Other             0
76  1985                 Africa                                            Comoros           Beer          0.02
77  1985                 Africa                                           Cameroon        Spirits          0.01
78  1989               Americas                                            Jamaica          Other             0
79  1989                 Europe                                            Finland          Other          2.09
80  1985                 Africa                                             Malawi          Other          0.84
81  1985                 Europe                                        Netherlands           Wine          2.54
82  1987                 Europe                                            Ireland        Spirits          2.25
84  1986        South-East Asia                                          Sri Lanka          Other             0
85  1985                 Africa                   Democratic Republic of the Congo           Wine          0.01
86  1986               Americas                                            Bahamas           Wine          1.83
87  1989  Eastern Mediterranean                                               Iraq           Wine          0.01
88  1987  Eastern Mediterranean                                            Lebanon           Beer          0.42
89  1986  Eastern Mediterranean                                            Lebanon           Wine           0.7
90  1989                 Africa                                             Malawi           Wine          0.01
91  1989                 Europe                                           Bulgaria           Beer          4.43
92  1986                 Africa                                            Eritrea        Spirits             0
94  1985                 Europe                                            Ukraine        Spirits          3.06
95  1984                 Africa                                              Niger          Other             0
96  1985                 Europe                                         Luxembourg           Wine          7.38
97  1984        South-East Asia                                          Indonesia           Wine             0
98  1984                 Africa                                  Equatorial Guinea           Wine             0
99  1985        South-East Asia              Democratic People's Republic of Korea           Wine             0

Write a Pandas program to remove the duplicates from 'WHO region' column of World alcohol consumption dataset.

In [234]:
df.drop_duplicates('WHO region')

0   Year             WHO region       Country Beverage Types Display Value
0   1986        Western Pacific      Viet Nam           Wine             0
1   1986               Americas       Uruguay          Other           0.5
2   1985                 Africa  Cte d'Ivoire           Wine          1.62
13  1984  Eastern Mediterranean   Afghanistan          Other             0
18  1984                 Europe        Norway        Spirits          1.62
20  1986        South-East Asia       Myanmar           Wine             0

Write a Pandas program to find out the alcohol consumption of a given year from the world alcohol consumption dataset

In [235]:
df['Display Value'] = df['Display Value'].astype('float64')

In [236]:
df.groupby('Year').agg({'Display Value': 'sum'})

      Display Value
Year
1984          19.17
1985          20.39
1986          29.03
1987          13.99
1989          22.21

Write a Pandas program to filter rows based on row numbers ended with 0, like 0, 10, 20, 30 from world alcohol consumption dataset

In [237]:
# https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#testing-for-strings-that-match-or-contain-a-pattern
df.index

RangeIndex(start=0, stop=100, step=1)

In [238]:
df.loc[pd.Series(df.index).apply(str).str.fullmatch(".?0")]

0   Year             WHO region                     Country Beverage Types  Display Value
0   1986        Western Pacific                    Viet Nam           Wine           0.00
10  1987                 Africa                    Botswana           Wine           0.20
20  1986        South-East Asia                     Myanmar           Wine           0.00
30  1986                 Africa                Sierra Leone          Other           4.48
40  1987                 Europe                     Austria        Spirits           1.90
50  1985                 Europe                 Switzerland          Other           0.30
60  1987  Eastern Mediterranean  Iran (Islamic Republic of)          Other           0.00
70  1986                 Africa                  Madagascar        Spirits           1.02
80  1985                 Africa                      Malawi          Other           0.84
90  1989                 Africa                      Malawi           Wine           0.01

In [239]:
# filter is for filtering the column or index names
df.filter(regex='0$', axis=0)

0   Year             WHO region                     Country Beverage Types  Display Value
0   1986        Western Pacific                    Viet Nam           Wine           0.00
10  1987                 Africa                    Botswana           Wine           0.20
20  1986        South-East Asia                     Myanmar           Wine           0.00
30  1986                 Africa                Sierra Leone          Other           4.48
40  1987                 Europe                     Austria        Spirits           1.90
50  1985                 Europe                 Switzerland          Other           0.30
60  1987  Eastern Mediterranean  Iran (Islamic Republic of)          Other           0.00
70  1986                 Africa                  Madagascar        Spirits           1.02
80  1985                 Africa                      Malawi          Other           0.84
90  1989                 Africa                      Malawi           Wine           0.01

Write a Pandas program to filter all records starting from the 2nd row, access every 5th row from world alcohol consumption dataset.

In [240]:
df.iloc[1::5]

0   Year             WHO region                                            Country Beverage Types  Display Value
1   1986               Americas                                            Uruguay          Other           0.50
6   1987                 Africa                                          Mauritius           Wine           0.13
11  1989               Americas                                          Guatemala           Beer           0.62
16  1984               Americas                                         Costa Rica           Wine           0.06
21  1989               Americas                                         Costa Rica        Spirits           4.51
26  1985                 Europe  United Kingdom of Great Britain and Northern I...           Wine           1.36
31  1986        Western Pacific                   Micronesia (Federated States of)           Wine           0.00
36  1987  Eastern Mediterranean                                              Egypt           Beer           0.07
41  1986                 Europe                                     Czech Republic           Beer           6.82
46  1987               Americas                                Trinidad and Tobago        Spirits           2.26
51  1987                 Europe                                            Finland           Beer           3.88
56  1987        Western Pacific                                           Viet Nam           Wine           0.00
61  1984        Western Pacific                                   Papua New Guinea        Spirits           0.08
66  1987  Eastern Mediterranean                                               Iraq           Wine           0.01
71  1985                 Africa                                               Mali          Other           0.57
76  1985                 Africa                                            Comoros           Beer           0.02
81  1985                 Europe                                        Netherlands           Wine           2.54
86  1986               Americas                                            Bahamas           Wine           1.83
91  1989                 Europe                                           Bulgaria           Beer           4.43
96  1985                 Europe                                         Luxembourg           Wine           7.38

Write a Pandas program to filter all columns where all entries present, check which rows and columns has a NaN and finally drop rows with any NaNs from world alcohol consumption dataset.

In [241]:
df.notna().all()

0
Year               True
WHO region         True
Country            True
Beverage Types     True
Display Value     False
dtype: bool

In [242]:
df.isna().any()

0
Year              False
WHO region        False
Country           False
Beverage Types    False
Display Value      True
dtype: bool

In [243]:
df.dropna(how='any', inplace=True)

## Misc

In [244]:
# Get 70 percentile
df = pd.DataFrame({"col1": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
                   "col2": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]})
df['col1'].quantile(0.66)

6.6000000000000005

In [245]:
# find row with closest value
target = 4.51
df.iloc[(df['col1']-target).abs().argsort()[0]]

col1    5
col2    5
Name: 5, dtype: int64

In [246]:
# How to do selection with label + number index?
df = pd.DataFrame({
    'name': ['Alberto  Franco','Gino Ann Mcneill','Ryan  Parkes', 'Eesha Artur Hinton', 'Syed  Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
df.index = ['a', 'b', 'c', 'd', 'e']

In [247]:
df

                 name date_of_birth   age
a     Alberto  Franco    17/05/2002  18.5
b    Gino Ann Mcneill    16/02/1999  21.2
c        Ryan  Parkes    25/09/1998  22.5
d  Eesha Artur Hinton    11/05/2002  22.0
e       Syed  Wharton    15/09/1997  23.0

In [248]:
df.iloc[df.index.get_loc("c"), 1]

'25/09/1998'

In [249]:
df.loc[df.index[2], "date_of_birth"]

'25/09/1998'

In [ ]:
# axis=1 preserves rows and axis=0 preserves cols?